{
  "day": 22,
  "title": "LAYING DOWN YOUR LIFE FOR THE SHEEP Part 4",
  "study_text": "",
  "scripture_ref": "John 10:11-18.",
  "scripture_text": "",
  "devotional": "“I am the good shepherd. The good shepherd lays down his life for the sheep. The hired hand is not the shepherd and does not own the sheep. So when he sees the wolf coming, he abandons the sheep and runs away.Then the wolf attacks the flock and scatters it. The man runs away because he is a hired hand and cares nothing for the sheep. “I am the good shepherd; know my sheep and my sheep know me—just as the Father knows me and I know the Father—and I lay down my life for the sheep. have other sheep that are not of this sheep pen. I must bring them also. They too will listen to my voice, and there shall be one flock and one shepherd The reason my Father loves me is that I lay down my life—only to take it up again. No one takes it from me, but I lay it down of my own accord. I have authority to lay it down and authority to take it up again. This command I received from my Father.”\n\nWe have been thinking about how Jesus laid down his life for the sheep. He did it because his sheep know him. Jesus said ‘I know my sheep and my sheep know me.’\n\nPart of the process of laying down your life is to become known. It is to open yourself up, becoming vulnerable, sharing your pain, weaknesses, and sin. The laid down life is one were there are no masks, pretences or performances, but honest openness. Knowing and being known are essential if we are going to find God’s appointed place for our lives.\n\n‘The reason why my Father loves me is that I lay down my life.’\n\nIt would be very easy to conclude from this verse that Jesus was saying that he needed to earn his father’s love by laying down his life. We know from the scriptures that God’s love cannot be bought or earned, so how are we to understand these words?\n\nCould it be that Jesus’ willing sacrifice elicited the Father’s eternal love in a fresh way? For example, I have loved my wife for over 25 years. Now if she does something that reflects her love for me, which would cause my love for her to well up in a fresh way so that I say, “I love you for doing that for me.” The love was there before her deed, but her deed called forth my love once more.\n\nI think Jesus is saying that when he laid down his life it did not cause God to love his Son. But it caused the love God had for his Son to to well up inside him. Maybe this is Jesus’ way of saying that the laid down life brings great joy and pleasure to God. The laying down of Jesus' life for the sheep, is an act that expresses to the world, that Jesus felt secure in his father’s love. Because Jesus felt secure in his father’s love he was prepared to lay down his life and eventually die on the cross.\n\nThe kind of ‘laid down life’ that God is looking for is only possible when we are feeling secure in the love of God. Feelings of insecurity will prevent a person from living a sacrificial laid down life, because insecurity encourages and develops selfishness within a person. The more we receive and enjoy God’s love the more secure we will be, and the more secure we are the more equipped we will be to lay down our lives.\n\nThe security Jesus felt, meant that he had the authority to lay down his life. ‘No one takes it from me but I lay it down of my own accord. I have authority to lay it down and authority to take it up again.’ This is alluding to Jesus’ death, but in this context it is primarily referring to how Jesus lived. The word that John uses for authority literally means ‘unrestricted possibility or freedom of action.’ In other words Jesus was free enough to lay down his life.\n\nWhen a person is free because they feel secure in the love of God, they will be prepared to meet the demands and sacrifices that the Christian life requires. We cannot live the life of a Christian without a conscious knowledge of God’s love. Knowledge of God’s love is the most effective sanctifying and freeing influence a person can experience.\n\nIn laying down his life for others Jesus was outworking the natural consequences of obeying his Father’s commandments. ‘I have authority to lay it down and authority to take it up again. This commandment I have received from my father.’\n\nIn our western culture we have over individualised obedience, but every time we obey the word of God, it is not solely for our own individual and personal benefit, but it is also for the enrichment and encouragement of others. Obedience to the commandments will equip a person for his ordination, it will make a laid down life a reality.\n\nWith that in mind, let me mention our understanding of abundant that Jesus refers to in verse 10. Abundant life is not an individualistic experience; rather it is the result of feeling secure within the flock. Abundant life is a relational quality that is discovered in the midst of community. Abundant life is an impossible individual experience.",
  "prayer": "- Father, may my love for you be seen in me laying down my life for others",
  "bible_reading": "Exodus 14:21-17:16",
  "has_links": false,
  "has_highlights": false,
  "html": "<h2 class=\"thought-title\">LAYING DOWN YOUR LIFE FOR THE SHEEP Part 4</h2>\n<div class=\"scripture-ref\">John 10:11-18.</div>\n<div class=\"devotional\"><p>“I am the good shepherd. The good shepherd lays down his life for the sheep. The hired hand is not the shepherd and does not own the sheep. So when he sees the wolf coming, he abandons the sheep and runs away.Then the wolf attacks the flock and scatters it. The man runs away because he is a hired hand and cares nothing for the sheep. “I am the good shepherd; know my sheep and my sheep know me—just as the Father knows me and I know the Father—and I lay down my life for the sheep. have other sheep that are not of this sheep pen. I must bring them also. They too will listen to my voice, and there shall be one flock and one shepherd The reason my Father loves me is that I lay down my life—only to take it up again. No one takes it from me, but I lay it down of my own accord. I have authority to lay it down and authority to take it up again. This command I received from my Father.”</p><p>We have been thinking about how Jesus laid down his life for the sheep. He did it because his sheep know him. Jesus said ‘I know my sheep and my sheep know me.’</p><p>Part of the process of laying down your life is to become known. It is to open yourself up, becoming vulnerable, sharing your pain, weaknesses, and sin. The laid down life is one were there are no masks, pretences or performances, but honest openness. Knowing and being known are essential if we are going to find God’s appointed place for our lives.</p><p>‘The reason why my Father loves me is that I lay down my life.’</p><p>It would be very easy to conclude from this verse that Jesus was saying that he needed to earn his father’s love by laying down his life. We know from the scriptures that God’s love cannot be bought or earned, so how are we to understand these words?</p><p>Could it be that Jesus’ willing sacrifice elicited the Father’s eternal love in a fresh way? For example, I have loved my wife for over 25 years. Now if she does something that reflects her love for me, which would cause my love for her to well up in a fresh way so that I say, “I love you for doing that for me.” The love was there before her deed, but her deed called forth my love once more.</p><p>I think Jesus is saying that when he laid down his life it did not cause God to love his Son. But it caused the love God had for his Son to to well up inside him. Maybe this is Jesus’ way of saying that the laid down life brings great joy and pleasure to God. The laying down of Jesus&#x27; life for the sheep, is an act that expresses to the world, that Jesus felt secure in his father’s love. Because Jesus felt secure in his father’s love he was prepared to lay down his life and eventually die on the cross.</p><p>The kind of ‘laid down life’ that God is looking for is only possible when we are feeling secure in the love of God. Feelings of insecurity will prevent a person from living a sacrificial laid down life, because insecurity encourages and develops selfishness within a person. The more we receive and enjoy God’s love the more secure we will be, and the more secure we are the more equipped we will be to lay down our lives.</p><p>The security Jesus felt, meant that he had the authority to lay down his life. ‘No one takes it from me but I lay it down of my own accord. I have authority to lay it down and authority to take it up again.’ This is alluding to Jesus’ death, but in this context it is primarily referring to how Jesus lived. The word that John uses for authority literally means ‘unrestricted possibility or freedom of action.’ In other words Jesus was free enough to lay down his life.</p><p>When a person is free because they feel secure in the love of God, they will be prepared to meet the demands and sacrifices that the Christian life requires. We cannot live the life of a Christian without a conscious knowledge of God’s love. Knowledge of God’s love is the most effective sanctifying and freeing influence a person can experience.</p><p>In laying down his life for others Jesus was outworking the natural consequences of obeying his Father’s commandments. ‘I have authority to lay it down and authority to take it up again. This commandment I have received from my father.’</p><p>In our western culture we have over individualised obedience, but every time we obey the word of God, it is not solely for our own individual and personal benefit, but it is also for the enrichment and encouragement of others. Obedience to the commandments will equip a person for his ordination, it will make a laid down life a reality.</p><p>With that in mind, let me mention our understanding of abundant that Jesus refers to in verse 10. Abundant life is not an individualistic experience; rather it is the result of feeling secure within the flock. Abundant life is a relational quality that is discovered in the midst of community. Abundant life is an impossible individual experience.</p></div>\n<div class=\"prayer\"><strong>Prayer:</strong> - Father, may my love for you be seen in me laying down my life for others</div>\n<div class=\"bible-reading\"><strong>Bible Reading:</strong> Exodus 14:21-17:16</div>"
}