{
  "day": 5,
  "title": "HAVE YOU ENOUGH FAITH TO STAY IN THE BOAT? Part 2.",
  "study_text": "",
  "scripture_ref": "Matthew 14:22-31.",
  "scripture_text": "Immediately Jesus made the disciples get into the boat and go on\nahead of him to the other side, while he dismissed the crowd. After he\nhad dismissed them, he went up on a mountainside by himself to pray.\nLater that night, he was there alone, and the boat was already a\nconsiderable distance from land, buffeted by the waves because the wind\nwas against it. Shortly before dawn Jesus went out to them, walking on\nthe lake. When the disciples saw him walking on the lake, they were\nterrified. \"It's a ghost,\"they said, and cried out in fear. But Jesus\nimmediately said to them: \"Take courage! It is I. Don't be afraid.\"\n\"Lord, if it's you,\" Peter replied, \"tell me to come to you on the\nwater.\" \"Come,\" he said. Then Peter got down out of the boat, walked\non the water and came toward Jesus. But when he saw the wind, he was\nafraid and, beginning to sink, cried out, \"Lord, save me!\" Immediately\nJesus reached out his hand and caught him. \"You of little faith,\" he\nsaid, \"why did you doubt?\" And when they climbed into the boat, the\nwind died down. Then those who were in the boat worshipped him, saying,\n\"Truly you are the Son of God.",
  "devotional": "Wanting to walk on water is rooted in a need to impress. It is\nexpressing a desire to be seen. It is living out of a belief that, what\nI can do is more important than who I am. Any desire we have to walk on\nwater, to be impressive is to value achievement above character.\n\nThere is a common misconception that God's will for our lives is\nprimarily about us. Look at what Peter says. \"Lord, if it's you,\" Peter\nreplied, \"tell me to come to you on the water.\" this is a very emphatic,\nexclusive statement, 'tell me!' We are inclined to over individualise\nGod's will. When we are seeking to know and do the will of God we should\nalways be concerned for the needs and blessing of others. Knowing and\ndoing the will of God should be an expression of our love for God and\nfor others. The will of God for our lives will always challenge and\nundermine our ego and potential for seflish living.\n\nIt is important to note that through Peter's attempt to walk on water,\nat that time Peter appears not to be thinking about anyone else.\n\nWhat may have been going on in Peter's heart?\n\nIt may be that Peter's decision to step out of the boat was motivated\nby internal conflict and turmoil. Was his choice to step out of the boat\nhis way of trying to manage his insecurities and fears? In this boat, in\nthe middle of a storm, this familiar place was the last place Peter\nwanted to be.' A place where he felt filled with uncertainty, fear and\nconfusion. This did not feel like the will of God, but it was!",
  "prayer": "",
  "bible_reading": "Genesis 14 v 13-chapter 18",
  "html": "<h2 class=\"thought-title\">HAVE YOU ENOUGH FAITH TO STAY IN THE BOAT? Part 2.</h2>\n<div class=\"scripture-ref\">Matthew 14:22-31.</div>\n<div class=\"scripture-text\"><p>Immediately Jesus made the disciples get into the boat and go on\nahead of him to the other side, while he dismissed the crowd. After he\nhad dismissed them, he went up on a mountainside by himself to pray.\nLater that night, he was there alone, and the boat was already a\nconsiderable distance from land, buffeted by the waves because the wind\nwas against it. Shortly before dawn Jesus went out to them, walking on\nthe lake. When the disciples saw him walking on the lake, they were\nterrified. &quot;It&#x27;s a ghost,&quot;they said, and cried out in fear. But Jesus\nimmediately said to them: &quot;Take courage! It is I. Don&#x27;t be afraid.&quot;\n&quot;Lord, if it&#x27;s you,&quot; Peter replied, &quot;tell me to come to you on the\nwater.&quot; &quot;Come,&quot; he said. Then Peter got down out of the boat, walked\non the water and came toward Jesus. But when he saw the wind, he was\nafraid and, beginning to sink, cried out, &quot;Lord, save me!&quot; Immediately\nJesus reached out his hand and caught him. &quot;You of little faith,&quot; he\nsaid, &quot;why did you doubt?&quot; And when they climbed into the boat, the\nwind died down. Then those who were in the boat worshipped him, saying,\n&quot;Truly you are the Son of God.</p></div>\n<div class=\"devotional\"><p>Wanting to walk on water is rooted in a need to impress. It is\nexpressing a desire to be seen. It is living out of a belief that, what\nI can do is more important than who I am. Any desire we have to walk on\nwater, to be impressive is to value achievement above character.</p><p>There is a common misconception that God&#x27;s will for our lives is\nprimarily about us. Look at what Peter says. &quot;Lord, if it&#x27;s you,&quot; Peter\nreplied, &quot;tell me to come to you on the water.&quot; this is a very emphatic,\nexclusive statement, &#x27;tell me!&#x27; We are inclined to over individualise\nGod&#x27;s will. When we are seeking to know and do the will of God we should\nalways be concerned for the needs and blessing of others. Knowing and\ndoing the will of God should be an expression of our love for God and\nfor others. The will of God for our lives will always challenge and\nundermine our ego and potential for seflish living.</p><p>It is important to note that through Peter&#x27;s attempt to walk on water,\nat that time Peter appears not to be thinking about anyone else.</p><p>What may have been going on in Peter&#x27;s heart?</p><p>It may be that Peter&#x27;s decision to step out of the boat was motivated\nby internal conflict and turmoil. Was his choice to step out of the boat\nhis way of trying to manage his insecurities and fears? In this boat, in\nthe middle of a storm, this familiar place was the last place Peter\nwanted to be.&#x27; A place where he felt filled with uncertainty, fear and\nconfusion. This did not feel like the will of God, but it was!</p></div>"
}