{
  "day": 1,
  "title": "THE WOMAN WITH THE ISSUE OF BLOOD Part 1",
  "study_text": "",
  "scripture_ref": "Luke 8:42b-48a",
  "scripture_text": "",
  "devotional": "‘As Jesus was on his way, the crowds almost crushed him. And a woman was there who had been subject to bleeding for twelve years, but no one could heal her. She came up behind him and touched the edge of his cloak and immediately her bleeding stopped. “Who touched me?” Jesus asked. When they all denied it, Peter said, “Master, the people are crowding and pressing against you.” But Jesus said, “Someone touched me; I know that power has gone out from me.” Then the woman, seeing that she could not go unnoticed, came trembling and fell at his feet. In the presence of all the people, she told why she had touched him and how she had been instantly healed. Then he said to her “Daughter, your faith has healed you, Go in peace.”\n\nI would like to start by sharing with you a letter I came across. It is very relevant to the story we are looking at.\n\nAnd, it is a type of letter we all might need to write.\n\nDear Fear-Of-What-Others-Think,‘I am sick of you, and it's time we broke up. I know we've broken up and gotten back together many times, but seriously, Fear-Of-What-Others-Think, this is it! We're breaking up! I'm tired of overthinking my status updates on social media, trying to sound more clever, funny, and important. I'm sick of feeling anxious about what I say or do in public, especially around people I don't know that well. Because of you, I go through my day with a cloud of shame hanging over my head, I can never live up to the expectations of my imaginary audience, the one that lives only in my head but whose collective voice is louder than any other voice in the universe. And all of this is especially evil because if I really stop and think about it, and let things go quiet and listen patiently for the voice of the God who made me, and the Saviour who died for me, in his eyes, it turns out I'm actually—profoundly—precious, lovable, worthy, valuable. Fear-Of-What-Others-Think, you and I are done. And no, I'm not interested in \"talking it through.\" I'm running, jumping, laughing you out of my life, once and for all. Or at least, that's what I really, really want, God help me! ’‘I go through my day with a cloud of shame hanging over my head,” adapted from <a href=\"https://wonderfullymade.org/2012/04/25/dear-fear-of-what-others-think/\">https://wonderfullymade.org/2012/04/25/dear-fear-of-what-others-think/</a> accessed 20/03/2025\n\nCan you relate to this?\n\nMany of us have or are living under the dominate power of shame.\n\n‘Shame affects us in some interesting and destructive ways. That’s because we relate it to who we are and not just what we felt, thought, or did. It eats away at self-image, gradually destroying a healthy sense of identity. Intellectually, we know our identity is secure in Christ, but emotionally, we can see ourselves as uniquely and unforgivably flawed.’ Doug Robinette <a href=\"https://www.healingcare.org/post/shame-a-crisis-of-identity#:~:text=The%20effects%20of%20shame%3A&amp;text=That&#39;s%20because%20we%20relate%20it,as%20uniquely%20and%20unforgivably%20flawed\">https://www.healingcare.org/post/shame-a-crisis-of-identity#:~:text=The%20effects%20of%20shame%3A&amp;text=That's%20because%20we%20relate%20it,as%20uniquely%20and%20unforgivably%20flawed</a>. Accessed 20/03/2025\n\nShame is the prominent form of identity theft, it robs a person of their true selves, causing them to live out of a false and destructive narrative about themselves. When Jesus spoke the name ‘daughter’ over this lady, her heart began to heal, and her identity was restored.",
  "prayer": "- Father help me not to live under a cloud of shame, help me to realise that how you see me is the truest thing about me.",
  "bible_reading": "Genesis 1-3.",
  "has_links": false,
  "has_highlights": false,
  "html": "<h2 class=\"thought-title\">THE WOMAN WITH THE ISSUE OF BLOOD Part 1</h2>\n<div class=\"scripture-ref\">Luke 8:42b-48a</div>\n<div class=\"devotional\"><p>‘As Jesus was on his way, the crowds almost crushed him. And a woman was there who had been subject to bleeding for twelve years, but no one could heal her. She came up behind him and touched the edge of his cloak and immediately her bleeding stopped. “Who touched me?” Jesus asked. When they all denied it, Peter said, “Master, the people are crowding and pressing against you.” But Jesus said, “Someone touched me; I know that power has gone out from me.” Then the woman, seeing that she could not go unnoticed, came trembling and fell at his feet. In the presence of all the people, she told why she had touched him and how she had been instantly healed. Then he said to her “Daughter, your faith has healed you, Go in peace.”</p><p>I would like to start by sharing with you a letter I came across. It is very relevant to the story we are looking at.</p><p>And, it is a type of letter we all might need to write.</p><p>Dear Fear-Of-What-Others-Think,‘I am sick of you, and it&#x27;s time we broke up. I know we&#x27;ve broken up and gotten back together many times, but seriously, Fear-Of-What-Others-Think, this is it! We&#x27;re breaking up! I&#x27;m tired of overthinking my status updates on social media, trying to sound more clever, funny, and important. I&#x27;m sick of feeling anxious about what I say or do in public, especially around people I don&#x27;t know that well. Because of you, I go through my day with a cloud of shame hanging over my head, I can never live up to the expectations of my imaginary audience, the one that lives only in my head but whose collective voice is louder than any other voice in the universe. And all of this is especially evil because if I really stop and think about it, and let things go quiet and listen patiently for the voice of the God who made me, and the Saviour who died for me, in his eyes, it turns out I&#x27;m actually—profoundly—precious, lovable, worthy, valuable. Fear-Of-What-Others-Think, you and I are done. And no, I&#x27;m not interested in &quot;talking it through.&quot; I&#x27;m running, jumping, laughing you out of my life, once and for all. Or at least, that&#x27;s what I really, really want, God help me! ’‘I go through my day with a cloud of shame hanging over my head,” adapted from <a href=\"https://wonderfullymade.org/2012/04/25/dear-fear-of-what-others-think/\">https://wonderfullymade.org/2012/04/25/dear-fear-of-what-others-think/</a> accessed 20/03/2025</p><p>Can you relate to this?</p><p>Many of us have or are living under the dominate power of shame.</p><p>‘Shame affects us in some interesting and destructive ways. That’s because we relate it to who we are and not just what we felt, thought, or did. It eats away at self-image, gradually destroying a healthy sense of identity. Intellectually, we know our identity is secure in Christ, but emotionally, we can see ourselves as uniquely and unforgivably flawed.’ Doug Robinette <a href=\"https://www.healingcare.org/post/shame-a-crisis-of-identity#:~:text=The%20effects%20of%20shame%3A&amp;text=That&#39;s%20because%20we%20relate%20it,as%20uniquely%20and%20unforgivably%20flawed\">https://www.healingcare.org/post/shame-a-crisis-of-identity#:~:text=The%20effects%20of%20shame%3A&amp;text=That's%20because%20we%20relate%20it,as%20uniquely%20and%20unforgivably%20flawed</a>. Accessed 20/03/2025</p><p>Shame is the prominent form of identity theft, it robs a person of their true selves, causing them to live out of a false and destructive narrative about themselves. When Jesus spoke the name ‘daughter’ over this lady, her heart began to heal, and her identity was restored.</p></div>\n<div class=\"prayer\"><strong>Prayer:</strong> - Father help me not to live under a cloud of shame, help me to realise that how you see me is the truest thing about me.</div>\n<div class=\"bible-reading\"><strong>Bible Reading:</strong> Genesis 1-3.</div>"
}